In [1]:
#Create a dict of 10 keys&values
#Convert that to a df
#Access 3rd,5th with forward index & last 6 values using reverse 
import pandas as pd
import numpy as np
name = ['Ramesh', 'Geetha', 'vineeth', 'Mani','Kamal','Venkat','Tharun','Shiva','Nikhil','Vikram']
age = [54,44,24,26,21,27,25,23,28,22]
data = {'Name':name,'Age':age}
# creating dictionary
print(data)
# passing dictionary to create dataframe
df = pd.DataFrame(data)
df

{'Name': ['Ramesh', 'Geetha', 'vineeth', 'Mani', 'Kamal', 'Venkat', 'Tharun', 'Shiva', 'Nikhil', 'Vikram'], 'Age': [54, 44, 24, 26, 21, 27, 25, 23, 28, 22]}

      Name  Age
0   Ramesh   54
1   Geetha   44
2  vineeth   24
3     Mani   26
4    Kamal   21
5   Venkat   27
6   Tharun   25
7    Shiva   23
8   Nikhil   28
9   Vikram   22

In [2]:
df.loc[[3]]#Acessing 3rd element

   Name  Age
3  Mani   26

In [3]:
df.loc[[5]]#Acessing 5th element

     Name  Age
5  Venkat   27

In [4]:
df[-6:]#Aceessing last 6 values

     Name  Age
4   Kamal   21
5  Venkat   27
6  Tharun   25
7   Shiva   23
8  Nikhil   28
9  Vikram   22